LINE_START = "Бабушка, бабушка, купим "
REPEAT = 2
RETURN = '\n'
ZOO = [["курочку!", "Курочка по зёрнышку кудах-тах-тах."],\
       ["уточку!", "Уточка та-ти-та-та,"],\
       ["индюшонка!", "Индюшонок фалды-балды,"],\
       ["кисоньку!", "А кисуня мяу-мяу,"],\
       ["собачонку!", "Собачонка гав-гав,"],\
       ["коровёнку!", "Коровёнка муки-муки,"],\
       ["поросёнка!", "Поросёнок хрюки-хрюки,"],\
       ["телевизор!", "Телевизор надо, надо, ведь у нас такое стадо!"]]
LINE_END = ""

# Печать всех куплетов: первые две строчки повторяются,
# последние накапливаются, за исключением телевизора:
for (animal_phrase, action_phrase) in ZOO:
    line_begin = ''.join([LINE_START, animal_phrase, RETURN] * REPEAT)
    if animal_phrase == "телевизор!":
        LINE_END = action_phrase
    else:
        LINE_END = ''.join([action_phrase, RETURN, LINE_END])
    print(line_begin + LINE_END)